{
  "emailDialog": {
    "title": "Votre adresse mail",
    "message": "Veuillez entrer votre adresse mail, nous vous enverrons un lien de connexion."
  },
  "logIn": {
    "waitingLoginMessage": "Veuillez vous connecter dans la fenêtre qui vient de s'ouvrir. Ne fermez pas l'application.",
    "waitingConfirmationMessage": "Nous vous avons envoyé un lien de confirmation par email. Veuillez cliquer dessus pour continuer. Ne fermez pas l'application.",
    "error": {
      "generic": "Quelque-chose s'est mal passé. Veuillez réessayer plus tard.",
      "timeoutDialog": {
        "title": "Délai d'attente dépasse",
        "message": "Délai d'attente dépassé pendant la connexion au fournisseur sélectionné. Veuillez réessayer."
      },
      "accountExistsWithDifferentCredentialsDialog": {
        "title": "Un compte existe déjà",
        "message": "Un compte avec la même adresse mail existe dans notre base de données, mais le fournisseur d'authentification sélectionné n'y est pas relié.\nVeuillez vous connecter en utilisant un fournisseur d'authentification qui y est déjà relié."
      },
      "invalidCredential": "Identifiants incorrects.",
      "operationNotAllowed": "Opération non autorisée. Cela ne doit pas arriver, veuillez reporter cette erreur.",
      "userDisabled": "Votre compte a été désactivé.",
      "firebaseException": "Une erreur est survenue pendant la connexion à votre compte (erreur : $exception). Veuillez réessayer plus tard.",
      "exception": "Une erreur est survenue (erreur : $exception). Veuillez réessayer plus tard."
    },
    "success": "Connexion réussie !",
    "successNeedConfirmation": "Succès ! Vous recevrez un email de confirmation bientôt. Veuillez cliquer sur le lien qui se trouve à l'intérieur avec cet appareil pour poursuivre la connexion."
  },
  "linkErrorTimeout": "Délai d'attente dépassé pendant la liaison de votre compte au fournisseur d'authentification. Veuillez réessayer.",
  "unlink": {
    "error": {
      "timeout": "Délai d'attente dépassé pendant la suppression de la liaison de votre compte au fournisseur d'authentification. Veuillez réessayer."
    },
    "confirmationDialog": {
      "title": "Supprimer la liaison au fournisseur",
      "message": "Voulez-vous vraiment supprimer la liaison e votre compte à ce fournisseur d'authentification ?"
    }
  },
  "providerPickerDialog": {
    "title": "Pick a login method",
    "email": {
      "title": "Email",
      "subtitle": "Utilisez votre adresse mail pour vous connecter. Pas besoin de mot de passe, nous vous enverrons un lien de confirmation."
    },
    "google": {
      "title": "Google",
      "subtitle": "Connectez-vous avec votre compte Google."
    },
    "apple": {
      "title": "Apple",
      "subtitle": "Connectez-vous avec votre compte Apple."
    },
    "microsoft": {
      "title": "Microsoft",
      "subtitle": "Connectez-vous avec votre compte Microsoft."
    },
    "twitter": {
      "title": "X",
      "subtitle": "Connectez-vous avec votre compte X."
    },
    "github": {
      "title": "Github",
      "subtitle": "Connectez-vous avec votre compte Github."
    }
  }
}